In [1]:
# importare tutte le librerie necessarie
import pandas as pd
import numpy as np
import datetime as dt
from tabulate import tabulate
import matplotlib.pyplot as plt
import seaborn as sns

path = r".\\DataSet\\"

In [2]:
allMadrid = pd.read_csv(path+"out.csv")
allMadrid.head()

,date,BEN,CO,EBE,NMHC,NO,NO_2,O_3,PM10,PM25,SO_2,TCH,TOL,station
0,2008-06-01 01:00:00,NaN,0.47,NaN,NaN,11.820078,83.089996,16.990000,16.889999,10.4,8.98,NaN,NaN,28079001
1,2008-06-01 01:00:00,NaN,0.59,NaN,NaN,11.820078,94.820000,17.469999,19.040001,NaN,5.85,NaN,NaN,28079003
2,2008-06-01 01:00:00,NaN,0.55,NaN,NaN,11.820078,75.919998,13.470000,20.270000,NaN,6.95,NaN,NaN,28079004
3,2008-06-01 01:00:00,NaN,0.36,NaN,NaN,11.820078,61.029999,23.110001,10.850000,NaN,5.96,NaN,NaN,28079039
4,2008-06-01 01:00:00,1.68,0.80,1.7,0.3,11.820078,105.199997,12.120000,37.160000,21.9,10.92,1.53,6.67,28079006

In [10]:
# Faccio un cambio di formato sul campo data passando da stringa a data
allMadrid['date'] = pd.to_datetime(allMadrid['date'].dt.strftime('%Y-%m-%d'))
print(allMadrid['date'])

0         2008-06-01
1         2008-06-01
2         2008-06-01
3         2008-06-01
4         2008-06-01
             ...
2190883   2018-02-01
2190884   2018-02-01
2190885   2018-02-01
2190886   2018-02-01
2190887   2018-02-01
Name: date, Length: 2190888, dtype: datetime64[ns]

In [11]:
allMadrid.groupby('date').sum()

,BEN,CO,EBE,NMHC,NO,NO_2,O_3,PM10,PM25,SO_2,TCH,TOL,station
date,,,,,,,,,,,,,
2008-01-01,241.839999,360.209999,191.390000,72.40,7068.406539,40116.569956,5225.189999,23753.830005,4719.759996,11393.830005,380.950000,740.880002,16791254949
2008-01-02,216.610001,306.320000,195.210000,64.95,7375.728563,41528.680061,5713.980000,13107.370016,2995.900005,9028.170006,368.819999,740.679998,17521309512
2008-01-03,139.770000,207.360000,180.920000,54.98,7375.728563,31456.420033,17491.090002,5467.360000,1078.539997,6718.209991,336.080000,559.080001,17521309512
2008-01-04,174.330001,264.380000,203.910000,61.32,7375.728563,36346.310011,12101.000005,12984.300003,2382.479997,8034.089980,335.510001,778.579998,17521309512
2008-01-05,158.160000,224.430000,150.770000,57.18,7375.728563,29504.149975,12039.190009,11678.559995,2397.259992,7366.009995,355.870001,622.890001,17521309512
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2018-04-27,52.500001,59.900001,63.900001,4.51,4460.000000,14993.000000,21811.000000,8120.000000,1477.000000,868.000000,96.540000,234.000000,16173525744
2018-04-28,31.200001,51.100001,28.000001,3.96,1627.000000,7783.000000,23950.000000,3423.000000,854.000000,865.000000,93.640000,99.600000,16173525744
2018-04-29,27.900001,52.400001,19.200000,3.83,1344.000000,6393.000000,26223.000000,2170.000000,465.000000,862.000000,92.870000,53.400001,16173525744
2018-04-30,36.600001,56.700001,23.200000,4.14,2625.000000,11852.000000,23053.000000,2141.000000,483.000000,912.000000,94.010000,83.900000,16173525744
2018-05-01,2.300000,2.500000,1.200000,0.18,69.000000,699.000000,789.000000,58.000000,16.000000,45.000000,3.970000,5.100000,673896906